[
  {
    "id": "rifle_assault",
    "copy-from": "m4a1",
    "type": "GUN",
    "name": { "str": "5.56mm assault rifle" },
    "ammo": "ammo_rifle",
    "description": "The products of decades of improvement, rifle such as this are handy, reliable, and adaptable.  An 'assault rifle', it is capable of providing both accurate semi-automatic fire and bursts of automatic fire.  Short of large creatures and light vehicles, this should take care of most of your problems out to several hundred meters.",
    "magazines": [ [ "ammo_rifle", [ "rifle_mag", "rifle_mag_hc" ] ] ],
    "dispersion": 200,
    "built_in_mods": [  ],
    "ranged_damage": { "damage_type": "bullet", "amount": 0 },
    "modes": [ [ "DEFAULT", "semi", 1 ], [ "BURST", "burst", 3 ], [ "AUTO", "auto", 5 ] ]
  },
  {
    "id": "rifle_lmg",
    "copy-from": "m240",
    "type": "GUN",
    "name": { "str": "5.56mm machine gun" },
    "ammo": "ammo_rifle",
    "description": "The light machine gun is a formidable implement for suppressive fire, an important part of squad tactics.  Its belt feed allows for hundreds of rounds to be loaded, and its heavy components can withstand long bursts of fire.  While perhaps not as precise as a service rifle, a light machinegun does allow for a considerable amount of energy to be sent down range.  Slow to reload.",
    "magazines": [ [ "ammo_rifle", [ "rifle_belt" ] ] ],
    "dispersion": 250,
    "built_in_mods": [  ],
    "ranged_damage": { "damage_type": "bullet", "amount": 0 },
    "modes": [ [ "BURST", "burst", 5 ], [ "AUTO", "auto", 10 ] ]
  },
  {
    "id": "rifle_pipe_rifle",
    "copy-from": "rifle_223",
    "type": "GUN",
    "name": { "str": "5.56mm pipe gun" },
    "ammo": "ammo_rifle",
    "description": "A crude longarm chambered in standard rifle ammunition, reinforced near the chamber.  It holds a single a round and has a crude assembly to fire it.  There's no extractor, so it might be slow to reload, and its construction makes for poor reliability and longevity.",
    "clip_size": 1,
    "magazines": [  ]
  },
  {
    "id": "rifle_pipe_carbine",
    "copy-from": "surv_carbine_223",
    "type": "GUN",
    "name": { "str": "crude 5.56mm carbine" },
    "ammo": "ammo_rifle",
    "description": "A crudely constructed carbine chambered for standard rifle ammo, fed from service rifle magazines.  It locks with a rudimentary lever action system.  The high pressures involved and questionable construction make for less than ideal durability and reliability, but this should still be a serviceable weapon, provided you can stay accurate with it.",
    "magazines": [ [ "ammo_rifle", [ "rifle_mag", "rifle_mag_hc" ] ] ]
  },
  {
    "id": "rifle_sporter",
    "copy-from": "ar15",
    "type": "GUN",
    "name": { "str": "5.56mm carbine" },
    "ammo": "ammo_rifle",
    "description": "Though often mislabeled an asssault rifle, this common, cheap magazine fed carbine isn't capable of automatic fire.  While almost as effective as a proper rifle, the wider variety of components and varying levels of maintenance make these less reliable than their military brethren.  These rifles are just as adequate for taking on anything smaller than large game, however.",
    "magazines": [ [ "ammo_rifle", [ "rifle_mag", "rifle_mag_hc" ] ] ],
    "dispersion": 150,
    "built_in_mods": [  ],
    "ranged_damage": { "damage_type": "bullet", "amount": 0 },
    "modes": [ [ "DEFAULT", "semi", 1 ] ]
  }
]
