[
  {
    "type": "snippet",
    "category": "tutorial_messages",
    "text": [
      {
        "id": "LESSON_INTRO",
        "text": "Welcome to the Cataclysm: BN tutorial!  As you play, pop-ups like this one will appear to guide you through the basic game actions.  Pressing spacebar will close the pop-up."
      },
      {
        "id": "LESSON_MOVE",
        "text": "To move, you can use the numpad, the vikeys (hjklyubn), or the arrow keys.  Keybinds are case sensitive, so make sure to have your CapsLock off."
      },
      {
        "id": "LESSON_LOOK",
        "text": "To examine your surroundings, press <key:DEFAULTMODE:look>.  You'll be able to scroll around and get information on the terrain, monsters, and items in the world around you."
      },
      {
        "id": "LESSON_MESSAGE_LOG",
        "text": "Your actions and events around you are saved to the message log, you can press <key:DEFAULTMODE:messages> to view it.  Tutorial popups are also saved there for your convenience."
      },
      {
        "id": "LESSON_OPEN",
        "text": "Your way is barred by a closed door.  To open it, either simply walk into it, or press <key:DEFAULTMODE:open> and then a movement key."
      },
      {
        "id": "LESSON_CLOSE",
        "text": "You can close an opened door by pressing <key:DEFAULTMODE:close> and then a movement key.  Closing doors behind you can often slow down throngs of monsters greatly."
      },
      {
        "id": "LESSON_WINDOW",
        "text": "You can smash through windows by pressing <key:DEFAULTMODE:smash> and then a movement key.  A smashed window takes a long time to climb through, and it's possible to hurt yourself on the broken glass, but it's a good last-ditch escape route.  You can smash through other things, too."
      },
      {
        "id": "LESSON_PICKUP",
        "text": "You can pick up items by pressing <key:DEFAULTMODE:pickup> and then a movement key.  You'll have to select which item to pick up and then confirm your choice.  You can press <key::HELP_KEYBINDINGS> at any time to view relevant controls."
      },
      {
        "id": "LESSON_WIELD_DROP",
        "text": "You don't currently have any inventory capacity, so you had to wield the stick in your hands.  You can press <key:DEFAULTMODE:wield> to wield items, and <key:DEFAULTMODE:drop> to drop them."
      },
      {
        "id": "LESSON_WEAR",
        "text": "To wear an item, press <key:DEFAULTMODE:wear>.  You don't necessarily have to pick it up first, you can wear it straight from the ground if you're close enough."
      },
      {
        "id": "LESSON_TAKEOFF",
        "text": "To take off an item, press <key:DEFAULTMODE:take_off>.  Worn items provide defense against attacks, but having too much clothing on you can slow you down or cause overheating."
      },
      {
        "id": "LESSON_INVENTORY",
        "text": "Some items, like backpacks, provide inventory capacity.  You can see your inventory by pressing <key:DEFAULTMODE:inventory> key.  If you have enough capacity, picked up items will be stashed in the inventory."
      },
      {
        "id": "LESSON_INVENTORY_DROP",
        "text": "If you take off the backpack, your inventory capacity will shrink, and some items may be dropped from your inventory."
      },
      {
        "id": "LESSON_RELOAD_ACTIVATE",
        "text": "Some items have special uses.  It's getting dark here, so wield the flashlight, load it with battery by pressing <key:DEFAULTMODE:reload> and turn it on by pressing <key:DEFAULTMODE:apply>."
      },
      {
        "id": "LESSON_ACTIVATE_NOTE",
        "text": "Some items don't have to be wielded to be used - sometimes it's enough to have them in your inventory on lying nearby.  You can press <key:DEFAULTMODE:apply> to use any such item.  Your flashlight, for example, will still light the way if stored in inventory."
      },
      { "id": "LESSON_ACTIVATE_WORN", "text": "Worn items can have special uses as well." },
      {
        "id": "LESSON_UNLOAD_DEACTIVATE",
        "text": "You can turn off the flashlight by using it again.  You can also take out the battery by pressing <key:DEFAULTMODE:unload>, and the flashlight will turn off by itself."
      },
      {
        "id": "LESSON_INTERACT",
        "text": "You can interact with many game objects and creatures by pressing general-purpose examine key <key:DEFAULTMODE:examine>."
      },
      {
        "id": "LESSON_MELEE_WEAPONS",
        "text": "Almost any item can be used as a melee weapon, but the effectiveness varies.  You can find out the item's damage value by opening inventory, selecting the item and pressing <key:INVENTORY:CONFIRM>."
      },
      {
        "id": "LESSON_MELEE_ATTACK",
        "text": "To attack, either walk into the enemy or press <key:DEFAULTMODE:autoattack> to automatically attack a nearby enemy."
      },
      {
        "id": "LESSON_REACH_WEAPONS",
        "text": "Some melee weapons, like spears, can harm the enemy from 2 or 3 tiles away.  This ability is called Reach Attack."
      },
      {
        "id": "LESSON_REACH_ATTACK",
        "text": "To perform a Reach Attack, wield the spear, press <key:DEFAULTMODE:fire>, select target and press <key:TARGET:FIRE>."
      },
      {
        "id": "LESSON_THROWING_WEAPONS",
        "text": "Any item can be thrown, though the range depends on the item's weight and your abilities.  Throwing weapons are special items that are easy to throw and deal increased damage on impact."
      },
      {
        "id": "LESSON_THROWING",
        "text": "To throw an item, press <key:DEFAULTMODE:throw>, select item, then select target and press <key:TARGET:FIRE>."
      },
      {
        "id": "LESSON_RANGED_WEAPONS",
        "text": "There are many ranged weapons available, from bows and crossbows to firearms.  They may serve in a varienty of ways, from silently dispatching a lone enemy to shredding groups of armored foes in seconds."
      },
      {
        "id": "LESSON_FIREARM_RELOAD_MAGAZINE",
        "text": "Firearms usually have a magazine that needs to be loaded with ammo.  Some firearms, like revolvers, can be reloaded directly.  To reload the magazine, pick it up and press <key:DEFAULTMODE:reload>."
      },
      {
        "id": "LESSON_FIREARM_RELOAD_GUN",
        "text": "Press <key:DEFAULTMODE:reload> again to reload the gun with the full magazine.  M164A can fire in either semi-auto or burst mode, you can switch between the two by pressing <key:DEFAULTMODE:select_fire_mode>.  It's also quite loud, don't forget your ear protection!"
      },
      {
        "id": "LESSON_RANGED_ATTACK",
        "text": "Press <key:DEFAULTMODE:fire> to start aiming.  You could either aim with <key:TARGET:AIM> for as long as you like and then shoot with <key:TARGET:FIRE>, or use one of the presets keyed to <key:TARGET:AIMED_SHOT>, <key:TARGET:CAREFUL_SHOT> and <key:TARGET:PRECISE_SHOT> to automatically aim to the stated threshold and shoot."
      }
    ]
  }
]
