[
  {
    "id": "trans_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Trans pride flag" },
    "description": "A transgender pride flag.  The blue represents transmascs, the pink represents transfemmes, and the white represents non-binary individuals.",
    "color": "light_blue"
  },
  {
    "id": "rainbow_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "LGBTQ+ pride flag" },
    "description": "The original pride flag of the entire LGBTQ+ community.  The rainbow of colors represents the rainbow of individuals throughout the community.",
    "color": "red"
  },
  {
    "id": "aromantic_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Aromantic pride flag" },
    "description": "An aromantic pride flag.  The greens represent aromanticism and the aro-spectrum as a whole, the white represents the importance of non-romantic relationships, and the black and grey represent the sexuality spectrum that ranges from aro-ace to aro-allosexual.",
    "color": "light_green"
  },
  {
    "id": "asexual_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Asexual pride flag" },
    "description": "An asexual pride flag.  The black represents total asexuality, the grey represents demisexuals and grey-asexuals, the white represents allies, and the purple represents community.",
    "color": "light_gray"
  },
  {
    "id": "bisexual_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Bisexual pride flag" },
    "description": "A bisexual pride flag.  The pink represents attraction to the same sex, the blue represents attraction to the opposite sex, and the purple overlap represents the combination of both.",
    "color": "magenta"
  },
  {
    "id": "intersex_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Intersex pride flag" },
    "description": "An intersex pride flag.  The center circle symbolizes wholeness and completeness.",
    "color": "yellow"
  },
  {
    "id": "lesbian_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Lesbian pride flag" },
    "description": "A lesbian pride flag.  The dark orange represents gender non-conformity, the orange represents independence, the white represents unique relationships to womanhood, pink represents serenity and peace, and the dark rose represents feminimity.",
    "color": "light_red"
  },
  {
    "id": "enby_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Non-binary pride flag" },
    "description": "A non-binary pride flag.  Yellow represents those who identify outside of the gender binary, white represents those with multiple genders, purple for those with a mix of both male and female, and black for agender individuals.",
    "color": "white"
  },
  {
    "id": "pansexual_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Pansexual pride flag" },
    "description": "A pansexual pride flag.  Pink represents being attracted to women, blue being attracted to men, and yellow being attracted to everyone else.",
    "color": "pink"
  },
  {
    "id": "gay_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Gay pride flag" },
    "description": "A gay pride flag for men.  The greens represent healing and joy; the white stripe includes people who are transgender, nonbinary, intersex, or otherwise likely to be traditionally left out; the blues represent pure love, strength, and diversity.",
    "color": "green"
  },
  {
    "id": "genderfluid_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Genderfluid pride flag" },
    "description": "A genderfluid pride flag.  The pink represents feminimity, the white represents lack of gender, the purple represents androgyny, the black represents all other genders, and the blue represents masculinity.",
    "color": "blue"
  },
  {
    "id": "autism_flag",
    "type": "ARMOR",
    "copy-from": "american_flag",
    "name": { "str": "Autism pride flag" },
    "description": "The autistic pride flag.  Gold middle band refers to the elemental symbol of gold (AU) which is used in the autistic community.  The gradient refers to the Pride Movement.  Red originated as a protest to the `light it up blue` campaign, which was denounced by the autistic community.  The infinity sign is a symbol long used in the wider autistic and wider neurodiverse community.",
    "color": "white"
  }
]
